{"class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "input_3", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 222], "name": "input_3"}}, {"name": "dense_7", "class_name": "Dense", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_7", "bias_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.99999993922529e-09}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "kernel_constraint": null, "units": 256, "activity_regularizer": null}}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["dense_7", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "name": "batch_normalization_7", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"name": "dropout_7", "class_name": "Dropout", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_7", "trainable": true, "noise_shape": null, "seed": null}}, {"name": "dense_8", "class_name": "Dense", "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_8", "bias_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.99999993922529e-09}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "kernel_constraint": null, "units": 256, "activity_regularizer": null}}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["dense_8", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "name": "batch_normalization_8", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"name": "dropout_8", "class_name": "Dropout", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_8", "trainable": true, "noise_shape": null, "seed": null}}, {"name": "dense_9", "class_name": "Dense", "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_9", "bias_constraint": null, "trainable": true, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.99999993922529e-09}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "kernel_constraint": null, "units": 256, "activity_regularizer": null}}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "inbound_nodes": [[["dense_9", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_constraint": null, "name": "batch_normalization_9", "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "scale": true, "epsilon": 0.001}}, {"name": "dropout_9", "class_name": "Dropout", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_9", "trainable": true, "noise_shape": null, "seed": null}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["input_3", 0, 0, {}], ["dropout_9", 0, 0, {}]]], "config": {"name": "concatenate_1", "trainable": true, "axis": -1}}, {"name": "dense_10", "class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_10", "bias_constraint": null, "trainable": true, "activation": "sigmoid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.99999993922529e-09}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "kernel_constraint": null, "units": 11, "activity_regularizer": null}}], "input_layers": [["input_3", 0, 0]], "output_layers": [["dense_10", 0, 0]]}}