{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 222], "input_dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 222, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 9.999999974752427e-07}, "activation": "relu", "output_dim": 512}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "dense_4"}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["dense_4", 0, 0]]], "name": "dropout_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 512, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 9.999999974752427e-07}, "activation": "relu", "output_dim": 512}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "dense_5"}, {"class_name": "Dropout", "config": {"p": 0.6, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["dense_5", 0, 0]]], "name": "dropout_4"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["input_2", 0, 0], ["dropout_4", 0, 0]]], "name": "merge_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 734, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "L1L2Regularizer", "l1": 9.999999974752427e-07}, "activation": "sigmoid", "output_dim": 11}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "dense_6"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_6", 0, 0]], "name": "model_2"}}